{"﻿\n\nUACE P515/1 Principles and practices of agriculture 2000 \nSECTION A (30 MARKS) \nWrite the letter corresponding to the correct answer \n1.Which one of the following best explains why chemical treatment of timber s usually done before \tthe timber is used to make structures? \n\tA.The wood is still fresh to allow easy chemical penetration \n\tB.The chemicals can be effectively applied to all parts of the wood \n\tC.The amount of chemicals required for treatment is small \n\tD.The treatment of wood takes a much shorter time \n2.Which of the following is an advantage of bulky livestock feed? It should \n\tA.Contain a lot of fiber \n\tB.Are high in nutrients \n\tC.Contain a lot of water \n\tD.Are largely digestible \n3.Which one of the following is a desirable quality of a semen diluent?  It should \n\tA.preserve the viability of spermatozoa \n\tB.remain liquid at low temperatures \n\tC.be able to increase the activity of spermatozoa \n\tD.decrease the viscosity of semen \n4.In the production process, it not advisable to operate below the economic optimum region because \tat this stage \n\tA.there is over utilization of resources \n\tB.there is scarcity of resources \n\tC.there is underutilization of resources \n\tD.resources are expensive \n5.Which of the following explains increased branching when the terminal bud of the stem is cut off? \n\tA.Increased levels of auxins \n\tB.Exposure to lower parts to sunlight \n\tC.Increased effects of gibberellins \n\tD.Increased rate of photosynthesis \n6.Which one of the following represents the correct sequence of ions during nitrification \n1 digitalteachers.co.ug \n\n\tA.Ammonium → nitrite → nitrates \n\tB.Ammonium → nitrates → nitrites \n\tC.Nitrate → nitrites → ammonia \n\tD.Nitrites → ammonium → nitrate \n7.A microscope has on eye piece of x10 and objective lenses of x10, x30, and x40. Which one of the \tfollowing is the maximum magnification possible with this microscope? \n\tA.90 times \n\tB.300 times \n\tC.400 time \n\tD.120,000times \n8.Which one of the following is not a unit of tractor transmission system? \n\tA.Differential \n\tB.Gear box \n\tC.Clutch \n\tD.Hydraulic pump \n9.One reason for making the pitch of a roof high when using grass as roofing material \tA.Reduce the effect of strong wind on the roof \n\tB.Improve durability of the roof \n\tC.Improve the ventilation of a house \n\tD.Make the building warmer \n10.Early maturity is a desirable characteristic in beef cattle because it \n\tA.reduces the chances of disease attack in animals \n\tB.saves on the feeding costs \n\tC.allows for early mating of animals \n\tD.results in better quality meat \n11.Which one of the following is not a likely cause of early leaf senescence in plants \tA.Pest and disease attack \n\tB.Water stress at early stage of growth \n\tC.Nitrogen deficiency in the soil \n\tD.High calcium level in the soil \n12.Which one of the following would cause a tractor engine to stop suddenly? \n\tA.Low fuel level in the tank \n\tB.Faulty ignition system \n\tC.Broken clutch \n\tD.Faulty cooling system \n13.Which one of the following is a reason for breeding for shortness in cereal crops? \nA.Making the crops more tolerant to draught \nB.Reducing hailstone damage on the crop \nC.Partitioning more assimilates to grains \nD.Making the crop more tolerant to disease and pest attack \n2 digitalteachers.co.ug \n\n14.One way in which air seasoning of wood is better than kiln seasoning is that \n\tA.Requires less stacking space \n\tB.Is a cheaper process \n\tC.Makes timber more resistant to insect and fungal attack \n\tD.Can decrease moisture content of timber to a desired level \n15.The dew lap in tropical cattle breeds serves to dispose of surplus heat from the animal by \tA.Absorbing excess heat from the body \n\tB.Fanning the animal as it swings \n\tC.Increasing the surface area of the animal \n\tD.Releasing a lot of sweat from its surface \n16.Which one of the following least affects the farming decision made by a common farmer? \n\tA.Government policy \n\tB.Opportunity cost \n\tC.Personal taste \n\tD.Farmer’s family size \n17.Which one of the following is a limitation of obtaining loans from individual money lender for a farm \tbusiness? \n\tA.Individual money lender are dishonest \n\tB.Interest rates on loans are too high \n\tC.Only short term loans are offered \n\tD.Terms of repayment are not specified \n18.Which one of the following is a characteristic of plants growing in highly water soil? \n\tA.Stunted growth \n\tB.Early maturity \n\tC.Wilting \n\tD.Shallow roots \n19.One reason why it is difficult to control fungal diseases in crops is that fungi \n\tA.Can hardly be seen with the naked eye \n\tB.Produce many spores \n\tC.Can tolerate a wide range of soil conditions \n\tD.Are resistant to chemicals applied to kill then \n20. A sample of animal feed gave positive results with both Biuret and Benedict’s test. Which of the \tfollowing foods were contained in the sample? \n\tA.Fat, mineral salts and proteins \n\tB.Proteins and carbohydrates \n\tC.Minerals salts and proteins \n\tD.Fats and carbohydrates \n21.Which one of the following types of pesticides is most suitable for controlling sucking pests? \nA.Contact pest \nB.Surface sterilants \nC.Systemic  pesticides \nD.fumigants \n3 digitalteachers.co.ug \n\n22.The bean disease characterized by brown, sunken and soaked lesions on the pond is \tA.Bean mosaic \n\tB.Angular leaf spot \n\tC.Bean rust \n\tD.Bean anthracnose \n23.Which one of the following factors does not changes in gene frequencies in population? \n\tA.Mutation \n\tB.Migration \n\tC.Genetic drift \n\tD.Epistasis \n24.Why is it not advisable to compost materials having a low carbon: nitrogen ratio? \n\tA.Organic matter and nitrogen can easily be lost from the material \n\tB.They take long to mineralize \n\tC.The microorganism involved consume most of the nitrogen in the material \tD.They become toxic to the plant \n25.The animal disease which is vector borne is \n\tA.Anthrax \n\tB.Foot and mouth \n\tC.Rinderpest \n\tD.Trypanosomiasis \n26.Which one of the following does not affect the quality of milk produced by a cow? \n\tA.Age of a cow \n\tB.The breed of a cow \n\tC.The type of feed \n\tD.The amount of feed \n27.Which one of the following information should be entered in a farm dairy? \n\tA.Farm tractor registration number \n\tB.Items sold or bought \n\tC.Farm enterprise \n\tD.Farm size \n28.One reason for pruning tea is to \n\tA.improve the quality of leaves \n\tB.encourage production of new shoots \n\tC.make harvest easier \n\tD.control fungal disease in the crop \n29.Goats are easier to rear than other farm animals because they can \tA.withstand extreme conditions \n\tB.eat leaves of shrubs and grass \n\tC.breed and multiply faster \n\tD.do without supplementary feeding \n30.one way in which enzyme differ from inorganic catalyst is that enzymes \tA.are very unstable \n4 digitalteachers.co.ug \n\nB.can be used over and over again \nC.are less effective than inorganic catalyst \nD.catalyze reversible reactions \nSECTION B \n31.(a)  Suggest six advantages of packaging as a marketing function (06marks) \n\t(b) Give four measures that could be taken to reduce the effects of price fluctuation on a farmer. \n\t\t(04marks) \n32.(a) Give six consideration that should be made by a farmer when selecting and preparing seeds for \t\tplanting. (06marks) \n\t(b)  Four advantages of planting crops on ridges. (04marks) \n33.(a)  Describe four precautions to be taken when air seasoning timber (04marks) \n\t(b) State three advantages and three disadvantages of using wood to make farm structures. \n\t(06marks) \n34.(a)  Explain the meaning of the following terms (02 marks each) \t(i) \tseed viability \n\t(ii) \tseed dormancy \n(b) Describe one method you would use to determine the viability of a sample of seeds. (03marks) \n(c) Explain the significance of seed dormancy (03marks) \n35.A cow produces milk after calving. It is then dried out before the next calving \t(a)(i) Describe two methods by which drying-off is achieved \n\t\t(ii) Explain how drying –off benefits the cow. (03marks) \n\t(b)Colostrum is produced by the cow for 3 to 4 days after calving. \n(i) State two ways in which colostrum in the first few days differ from ordinary milk. (02marks) (ii) State two benefits to the calf of being given colostrum the first few days of its life. (02marks) \n5 digitalteachers.co.ug \n\nSuggested answers \n1B\n4C\n7C\n10B\n13D\n16D\n19C\n22D\n25D\n28D\n2A\n5C\n8A\n11A\n14B\n17C\n20B\n23D\n26D\n29B\n3A\n6D\n9B\n12A\n15C\n18D\n21C\n24D\n27B\n30D\nComments \n18. Shallow root system to lack of oxygen in deeper soil layers \n24. High nitrogen content may be toxic to composting microbes \nSECTION B \n31.(a)  Suggest six advantages of packaging as a marketing function (06marks) \n-\tProtection: It safeguards products from damage during transportation, handling, and storage. \n-\tInformation: Packaging provides essential details about the product, such as ingredients, usage \ninstructions, and expiration dates. \n-\tSafety: Proper packaging ensures that products reach consumers in good condition, preventing \ncontamination and spoilage. \n-\tBranding: Attractive and well-designed packaging helps in building brand identity and \nrecognition. \n-\tMarketing: Packaging can be a powerful marketing tool, attracting customers and influencing \ntheir purchasing decisions. \n-\tConvenience: It makes products easier to handle, store, and use. \n-\tSustainability: Innovative packaging solutions can reduce environmental impact by using \nrecyclable or biodegradable materials. \n(b)Give four measures that could be taken to reduce the effects of price fluctuation on a farmer. \n(04marks) \n-\tBuffer stocks. The government should buy up part of the supply when output is in excess, store \nthis surplus and later sells it to the consumer in times of reduced supply. \n-\tStabilization fund. The government through marketing boards can maintain or increase prices of \nagricultural products, depending on world market prices. If profits are made, they are saved and \nused to stabilize prices and incomes of the farmers. \n-\tA variety of agricultural activities should be introduced e.g. crop farming, poultry, animal \nhusbandry etc. to reduce over dependence on one or a few sources of agricultural income in a \nbid to stabilize farmers’ income. \n-\tEncourage formation of cooperatives to bargain fair prices \n-\tIntroduce irrigation schemes to ensure continuous supply of agricultural products. \n6 digitalteachers.co.ug \n\n-\tStability in prices of agriculture can also be attained by improving transport system to enable \neasy marketing \n-\tThere is a need to improve, develop and expand storage facilities to accommodate excess \noutput in agriculture. \n-\tPrice control. Government should establish the minimum and maximum prices for agricultural \noutput. \n-\tMarket expansion. Government should expand agricultural output market through economic \nintegrations \n-\tencourage further diversification of agriculture \n-\tEncourage  processing to increase value and shelf-life \n-\tDissemination of marketing information to the farmers. \n32.(a) Give six consideration that should be made by a farmer when selecting and preparing seeds for \nplanting. (06marks) \n-\tShould be viable \n-\tShould be disease \n-\tShould be free from mechanical damage \n-\tShould be mature \n-\tShould have appropriate size to ensure enough food reserve \n-\tShould be free from contamination \n-\tShould be of desired genetic make up \n-\tShould be plump i.e. well-formed and not wrinkled \n(b)Four advantages of planting crops on ridges. (04marks) \n-\tImproved weed control: ridges reduce weed density \n-\tWarmer soil temperature: the ridges warm up sooner because the residue from the previous \ncrop settle between them \n-\tBetter soil moisture \n-\tBetter aeration \n-\tErosion control: ridges act like mini terraces, reducing soil erosion \n-\tReduced herbicide costs due to the effective weed control \n-\tControlled traffic patterns: this system helps in managing traffic patterns, reducing soil \ncompaction \n33.(a)  Describe four precautions to be taken when air seasoning timber (04marks) \n-\tProtection of timber from termites, insects and rodents to prevent destruction \n-\tDrying of the timber indoors to allow uniform drying to prevent cracking and shrinkage \n-\tProtection from water and excessive humidity to prevent them from rotting and hasten drying \n-\tHeaped on leveled ground to prevent from wrapping and gap left to allow air circulation. \n-\tPreservation of handling equipment to prevent rotting \n7 digitalteachers.co.ug \n\n(b) State three advantages and three disadvantages of using wood to make farm structures. \n(06marks) \nAdvantages of using wood to make farm structures\n-\tIt is relatively cheap \n-\tDurable \n-\tEasily worked with simple tools \n-\tLess labour is required to work with wood \nDisadvantages of using wood to make farm structures\n-\tEasily catch fire\n-\tRequire treatment to last\n-\tLow strength\n-\tEasily affected by weather\n34.(a)  Explain the meaning of the following terms (02 marks each) \n(i) \tseed viability \nSeed viability refers to the ability of a seed to germinate and develop into a healthy \nseedling under favorable conditions.\n(ii) \tseed dormancy \nSeed dormancy is defined as the inability of a viable seed to germinate under\nconditions favorable for germination. \n(b) Describe one method you would use to determine the viability of a sample of seeds. (03marks) \n-\tGermination Test: Place a specific number of seeds (e.g., 100) on a moist paper towel, fold it,\nand place it in a plastic bag. Keep it in a warm place and check after a few days to see how many\nseeds have sprouted. \n-\tWater Test: Place seeds in a container of water. Viable seeds will sink, while non-viable seeds\nwill float. \n-\tExcised Embryo Test: This involves removing the embryo from the seed and placing it in \na nutrient solution to see if it grows. \n-\t Chemical Test: Some seeds can be tested using chemicals that react with living tissues, \nindicating viability. \noViable seeds soaked in 0.1% tetrazolium salt solution and left for 24 hours will \nhave their  embryo stained red. \noViable seeds decolorize warm potassium permanganate solution \n-\tThe electrical conductivity test measures the leachate’s conductivity when seeds are soaked in \nwater, providing an indirect assessment of seed viability. \n(c)Explain the significance of seed dormancy (03marks) \n-\nSurvival in adverse conditions\n8 digitalteachers.co.ug \n\n\n-\n-\nAllows seeds and fruits to disperse \nArtificial storage: Seed dormancy allows agricultural seeds to be stored artificially.\n35.A cow produces milk after calving. It is then dried out before the next calving \t(a)(i) Describe two methods by which drying-off is achieved \n-\nIncomplete milking: this involves milking  the cow  half way its production capacity so that the\nremaining milk  in the udder  exerts  pressure  on the  milk secreting  cells which will stop secreting  milk.\n-\nIntermittent milking: the cow is milked at intervals of days and later left completely after 5 days\nor more. \n-\nCessation Milking: this is when milking stopped once for all.  It causes a lot of pain to the animal\nand can easily result into mastitis \n-\nDry cow therapy: Here antibiotics are included in feeds which will control mastitis.\n(ii) Explain how drying –off benefits the cow. (03marks) \n-Allow the cow to restore udder tissues before getting  back to lactation -Allow the cow to replace  the minerals depleted during lactation -To maintain a high future  milk yield  in the next lactation \n-Enable the cow  to gain weight  before delivering \n-To ensure high quality colostrum at birth \n-To enable treatment of sick cow \n(b)Colostrum is produced by the cow for 3 to 4 days after calving. \n(i) State two ways in which colostrum in the first few days differ from ordinary milk. (02marks) \n-Colostrum is filled with immunoglobins to boost your baby's immune system and protect it \tfrom illness. \n-Colostrum has two times as much protein. \n-Colostrum has four times as much zinc. \n-Colostrum is lower in fat and sugar so it's easier to digest. -Colostrum is thicker and more yellow. \n(ii) State two benefits to the calf of being given colostrum the first few days of its life. (02marks) \n-Calves obtain passive immunity \n-reduces chances of diseases \n-Reduced death rates \n-Better growth rates \n9 digitalteachers.co.ug \n\n-Improved lifetime productivity and fertility \nPlease obtain free downloadable notes of general paper, biology, economics, geography etc. from \ndigitalteachers.co.ug website \nThanks \nDr. Bbosa Science \n10 digitalteachers.co.ug": null}