{
    "message": [
       {
            "id": 1,
            "
        UACE P515/1 Principles and practices of agriculture 2000
SECTION A (30 MARKS)
Write the letter corresponding to the correct answer
1. Which one of the following best explains why chemical treatment of timber s usually done before
the timber is used to make structures?
A. The wood is still fresh to allow easy chemical penetration
B. The chemicals can be effectively applied to all parts of the wood
C. The amount of chemicals required for treatment is small
D. The treatment of wood takes a much shorter time
2. Which of the following is an advantage of bulky livestock feed? It should
A. Contain a lot of fiber
B. Are high in nutrients
C. Contain a lot of water
D. Are largely digestible
3. Which one of the following is a desirable quality of a semen diluent? It should
A. preserve the viability of spermatozoa
B. remain liquid at low temperatures
C. be able to increase the activity of spermatozoa
D. decrease the viscosity of semen
4. In the production process, it not advisable to operate below the economic optimum region because
at this stage
A. there is over utilization of resources
B. there is scarcity of resources
C. there is underutilization of resources
D. resources are expensive
5. Which of the following explains increased branching when the terminal bud of the stem is cut off?
A. Increased levels of auxins
B. Exposure to lower parts to sunlight
C. Increased effects of gibberellins
D. Increased rate of photosynthesis
6. Which one of the following represents the correct sequence of ions during nitrification
2 digitalteachers.co.ug
A. Ammonium → nitrite → nitrates
B. Ammonium → nitrates → nitrites
C. Nitrate → nitrites → ammonia
D. Nitrites → ammonium → nitrate
7. A microscope has on eye piece of x10 and objective lenses of x10, x30, and x40. Which one of the
following is the maximum magnification possible with this microscope?
A. 90 times
B. 300 times
C. 400 time
D. 120,
        000times
8. Which one of the following is not a unit of tractor transmission system?
A. Differential
B. Gear box
C. Clutch
D. Hydraulic pump
9. One reason for making the pitch of a roof high when using grass as roofing material
A. Reduce the effect of strong wind on the roof
B. Improve durability of the roof
C. Improve the ventilation of a house
D. Make the building warmer
10. Early maturity is a desirable characteristic in beef cattle because it
A. reduces the chances of disease attack in animals
B. saves on the feeding costs
C. allows for early mating of animals
D. results in better quality meat
11. Which one of the following is not a likely cause of early leaf senescence in plants
A. Pest and disease attack
B. Water stress at early stage of growth
C. Nitrogen deficiency in the soil
D. High calcium level in the soil
12. Which one of the following would cause a tractor engine to stop suddenly?
A. Low fuel level in the tank
B. Faulty ignition system
C. Broken clutch
D. Faulty cooling system
13. Which one of the following is a reason for breeding for shortness in cereal crops?
A. Making the crops more tolerant to draught
B. Reducing hailstone damage on the crop
C. Partitioning more assimilates to grains
D. Making the crop more tolerant to disease and pest attack
3 digitalteachers.co.ug
14. One way in which air seasoning of wood is better than kiln seasoning is that
A. Requires less stacking space
B. Is a cheaper process
C. Makes timber more resistant to insect and fungal attack
D. Can decrease moisture content of timber to a desired level
15. The dew lap in tropical cattle breeds serves to dispose of surplus heat from the animal by
A. Absorbing excess heat from the body
B. Fanning the animal as it swings
C. Increasing the surface area of the animal
D. Releasing a lot of sweat from its surface
16. Which one of the following least affects the farming decision made by a common farmer?
A. Government policy
B. Opportunity cost
C. Personal taste
D. Farmer’s family size
17. Which one of the following is a limitation of obtaining loans from individual money lender for a farm
business?
A. Individual money lender are dishonest
B. Interest rates on loans are too high
C. Only short term loans are offered
D. Terms of repayment are not specified
18. Which one of the following is a characteristic of plants growing in highly water soil?
A. Stunted growth
B. Early maturity
C. Wilting
D. Shallow roots
19. One reason why it is difficult to control fungal diseases in crops is that fungi
A. Can hardly be seen with the naked eye
B. Produce many spores
C. Can tolerate a wide range of soil conditions
D. Are resistant to chemicals applied to kill then
20. A sample of animal feed gave positive results with both Biuret and Benedict’s test. Which of the
following foods were contained in the sample?
A. Fat, mineral salts and proteins
B. Proteins and carbohydrates
C. Minerals salts and proteins
D. Fats and carbohydrates
21. Which one of the following types of pesticides is most suitable for controlling sucking pests?
A. Contact pest
B. Surface sterilants
C. Systemic pesticides
D. fumigants
4 digitalteachers.co.ug
22. The bean disease characterized by brown, sunken and soaked lesions on the pond is
A. Bean mosaic
B. Angular leaf spot
C. Bean rust
D. Bean anthracnose
23. Which one of the following factors does not changes in gene frequencies in population?
A. Mutation
B. Migration
C. Genetic drift
D. Epistasis
24. Why is it not advisable to compost materials having a low carbon: nitrogen ratio?
A. Organic matter and nitrogen can easily be lost from the material
B. They take long to mineralize
C. The microorganism involved consume most of the nitrogen in the material
D. They become toxic to the plant
25. The animal disease which is vector borne is
A. Anthrax
B. Foot and mouth
C. Rinderpest
D. Trypanosomiasis
26. Which one of the following does not affect the quality of milk produced by a cow?
A. Age of a cow
B. The breed of a cow
C. The type of feed
D. The amount of feed
27. Which one of the following information should be entered in a farm dairy?
A. Farm tractor registration number
B. Items sold or bought
C. Farm enterprise
D. Farm size
28. One reason for pruning tea is to
A. improve the quality of leaves
B. encourage production of new shoots
C. make harvest easier
D. control fungal disease in the crop
29. Goats are easier to rear than other farm animals because they can
A. withstand extreme conditions
B. eat leaves of shrubs and grass
C. breed and multiply faster
D. do without supplementary feeding
30. one way in which enzyme differ from inorganic catalyst is that enzymes
A. are very unstable
5 digitalteachers.co.ug
B. can be used over and over again
C. are less effective than inorganic catalyst
D. catalyze reversible reactions
SECTION B
31. (a) Suggest six advantages of packaging as a marketing function (06marks)
(b) Give four measures that could be taken to reduce the effects of price fluctuation on a farmer.
(04marks)
32. (a) Give six consideration that should be made by a farmer when selecting and preparing seeds for
planting. (06marks)
(b) Four advantages of planting crops on ridges. (04marks)
33. (a) Describe four precautions to be taken when air seasoning timber (04marks)
(b) State three advantages and three disadvantages of using wood to make farm structures.
(06marks)
34. (a) Explain the meaning of the following terms (02 marks each)
(i) seed viability
(ii) seed dormancy
(b) Describe one method you would use to determine the viability of a sample of seeds. (03marks)
(c) Explain the significance of seed dormancy (03marks)
35. A cow produces milk after calving. It is then dried out before the next calving
(a) (i) Describe two methods by which drying-off is achieved
(ii) Explain how drying –off benefits the cow. (03marks)
(b) Colostrum is produced by the cow for 3 to 4 days after calving.
(i) State two ways in which colostrum in the first few days differ from ordinary milk. (02marks)
(ii) State two benefits to the calf of being given colostrum the first few days of its life. (02marks)
    ]

        }
    ]
}